In [2]:
import numpy as np 
import pandas as pd 
from pandas import Series,DataFrame

In [3]:
dframe = DataFrame(np.arange(12).reshape(3,4),index=['ny','la','sf'],columns=['a','b','c','d'])

In [4]:
dframe.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [5]:
dframe.index= dframe.index.map(str.lower)

In [6]:
dframe

    a  b   c   d
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [7]:
dframe.rename(index=str.title,columns=str.lower) #first letter capitalized

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

In [8]:
dframe.rename(index={'ny':'New york'},columns={'a':'alpha'})

          alpha  b   c   d
New york      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [9]:
dframe

    a  b   c   d
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [10]:
dframe.rename(index={'ny':'New york'},columns={'a':'alpha'},inplace=True)

In [11]:
dframe

          alpha  b   c   d
New york      0  1   2   3
la            4  5   6   7
sf            8  9  10  11